<?php

return [

    'error_number_requests_exceeded' => 'Превышено число попыток, попробуйте снова через 5 минут!',
    'user_not_found' => 'Пользователь не найден!',
    'phone_required' => 'Поле с телефоном должно быть заполненно!',
    'phone_phone' => 'Данное поле должно содержать номер мобильного телефона!',
    'string' => 'Не верный формат данных!',
    'max' => 'Превышена допустимая длина строки!',
    'min' => 'Слишком короткая строка!',
    'code_required' => 'Sms код - обязательное поле!',
    'error_failed_sms_code' => 'Не верный код (или уже не актуальный)',
    'error_critical' => 'Произошла неожиданная ошибка, попробуйте позже!',
    'wait_1_minute' => 'Подождите 1 минуту после отправки предыдущего сообщения!',
    'error_uniq_nickname' => 'Nickname должен быть уникальным!',
    'name_required' => 'Поле с Имя должно быть заполненно!',
    'phone_unique' => 'Этот номер уже используется!',
    'password_min' => 'Пароль не должен быть короче 6 символов!',
    'password_required' => 'Поле с паролем должно быть заполненно!',
    'refresh_token_required' => 'refresh_token - обазятельное поле',
    'failed_login_pass' => 'Не верный логин / пароль!',
    'failed_token_update' => 'Не удалось, токен не существует!',
    'token_update_lost_time' => 'Не удалось, старый токен!',
    'token_update_unknown_ip' => 'Не известный IP, перелогиньтесь!',
    'token_failed' => 'Не действительный токен!',
    'token_incorrect' => 'Неверный токен',

];
